# Задача 1. Язык математики

# Дана программа:

a = 8
b = 10
c = 12
d = 18

# Выражение: (-3 + a**2) * b - 2**3 / (c - 2 * d)
res = (-3 + a**2) * b - 2**3 / (c - 2 * d)

# Вывод результата
print(res)
