# Задача 4. Площадь треугольника

# Получение длин катетов от пользователя
a = float(input('Введите длину первого катета: '))
b = float(input('Введите длину второго катета: '))

# Вычисление площади треугольника
area = (a * b) / 2

# Вывод результата
print('Площадь треугольника:', area)
